Repository: iananass/smooth-task-next
Catalog: po/*.po
Languages: de, fr

source: General
de: Allgemein
fr: Général

source: Appearance
de: Erscheinungsbild
fr: Apparence

source: Do Not Group
de: Nicht gruppieren
fr: Ne pas grouper

source: By Program Name
de: Nach Programmname
fr: Par nom de programme

source: Do Not Sort
de: Nicht sortieren
fr: Ne pas trier

source: Manually
de: Manuell
fr: Manuellement

source: Alphabetically
de: Alphabetisch
fr: Par ordre alphabétique

source: By Desktop
de: Nach Arbeitsfläche
fr: Par bureau

source: No Action
de: Keine Aktion
fr: Pas d'action

source: Close Task
de: Task Beenden
fr: Fermer la tâche

source: Move to Current Desktop
de: Auf die Aktuelle Arbeitsfläche Verschieben
fr: Déplacer vers le bureau courant

source: Rectangle
de: Rechteck

source: Square
de: Quadrat
fr: Carré

source: None
de: Keine
fr: Rien

source: By Taskbar Shape
de: Nach der Form der Taskleiste
fr: Selon la forme de la barre des tâches

source: Maximum Squeeze
de: Maximale Dichte
fr: Réduire au maximum

source: Fixed Item Number per Row
de: Fixe Anzahl von Tasks pro Zeile
fr: Nombre fixe de tâches par ligne

source: Limited Squeeze
de: Beschränkte Komprimierung
fr: Réduire à proportion

source: Fixed Maximum Item Height
de: Fixe maximale Task-Höhe
fr: Hauteur maximale des tâches fixe

source: Active
de: Aktive
fr: Les tâches actives

source: From the current desktop
de: Von der aktuellen Arbeitsfläche
fr: Les tâches du bureau courant

source: All
de: Alle
fr: Toutes les tâches

source: Classic
de: Klassisch
fr: Classique

source: New
de: Neu
fr: Nouveau

source: On all desktops
de: Auf allen Arbeitsflächen
fr: Sur tous les bureaux

# Which virtual desktop a window is currently on
source: On %1
de: Auf %1
fr: Sur %1

source: On various desktops
de: Auf verschiedenen Arbeitsflächen
fr: Sur plusieurs bureaux

source: Starting application...
de: Programm wird gestartet...
fr: Démarrage de l'application...

source: Task Items
de: Tasks
fr: &Tâches

source: Task &Shape:
de: Task&form:
fr: &Forme de la tâche:

source: <p>This setting is only effective when there is enough room in the taskbar to display the task items in the according shape.</p> <h4>Rectangle</h4> <p>Displays collapsed task items as rectangles.</p> <h4>Square</h4> <p>Displays collapsed task items as squares.</p>
de: <p>Diese Option is nur effektiv wenn in der Taskleiste genug Platz vorhanden ist um die jeweilige Form anzuzeigen.</p> <h4>Rechteck</h4> <p>Zeigt zugeklappte Tasks als Rechteck an.</p> <h4>Quadrat</h4> <p>Zeigt zugeklappte Tasks als Quadrat an.</p>
fr: <p>Cette configuration est effective seulement quand il y a suffisamment de place dans la barre pour afficher les tâches avec la forme correspondante.</p> <h4>Rectangle</h4> <p>Affiche les tâches réduites avec des rectangles.</p> <h4>Carré</h4> <p>Affiche les tâches réduites avec des carrés.</p>

source: Space &Between Tasks:
de: &Platz zwischen den Programmen:
fr: &Espace entre les tâches:

source: &Icon Scale:
de: &Symbolskalierung:
fr: Taille de l'&icône:

source: The scale of the task icons in relation to the height/width (whatever is smaller) of the task item.
de: Die Skalierung der Tasks in Relation zu der Höhe/Breite (was auch immer kleiner ist) des Tasks.
fr: Echelle des icônes de tâche en fonction de la hauteur/largeur (la plus grande des deux) du cadre de la tâche.

source: &Expand Tasks
de: Tasks aus&klappen
fr: &Développer les tâches

source: E&xpanding Size:
de: &Ausklappgröße:
fr: Taille du dévelo&ppement:

source: This is the additional size that gets added to a task item when it expands. Keep in mind that the task items might not be able to expand fully when there is not enough room.
de: Dies ist die zusätzliche Breite, die ein Task erhält, wenn er aufgeklappt wird. Wenn nicht genug Platz in der Taskleiste vorhanden ist, kann dieser Wert auch unterschritten werden.
fr: Ceci est la largeur additionnelle d'une tâche quand elle se développe. Garder à l'esprit qu'une tâche ne peut se développer s'il n'y a pas suffisamment d'espace.

source: &Keep Expanded:
de: Ausgeklappt &lassen:
fr: &Maintenir développées:

source: When this is checked a blob of light is drawn on the task items when you hover them or when they demand attention.
de: Wenn diese Option ausgewählt ist wird ein Licht-Fleck auf den Tasks angezeigt wenn die Maus diese berührt oder der Task Aufmerksamkeit verlangt.
fr: Quand ceci est coché, un éclairage est placé sur la tâche lorsque vous passez dessus ou lorsqu'elle demande votre attention.

source: &Lights
de: &Beleuchtung
fr: Retro-éclaira&ge de la tâche

source: Expand on &Hover
de: Bei &Mauskontakt aufklappen
fr: Déve&lopper au survol

source: For some plasma themes task items might look better when their frames are not rotated. This only concerns vertical layouts, e.g. when you place the taskbar at the left (or right) screen edge.
de: Für manche Plasma-Schemata sieht es eventuell besser aus, wenn die Rahmen der Tasks nicht rotiert werden. Dies betrifft nur vertikale Layouts, z.B. wenn die Taskleiste am linken (oder rechten) Bildschirmrand platziert ist.
fr: Pour quelques thèmes plasma, les tâches ont meilleure apparence quand leurs cadres n'ont pas subi de rotation. Cela concerne uniquement les dispositions verticales, c'est-à-dire lorsque la barre des tâches est placée sur le côté gauche ou droit de l'écran.

source: Don't &Rotate Frames
de: Rahmen &nicht rotieren
fr: Pas de &rotation des cadres

source: Usually a different frame for hovered task items is used. But for some plasma themes this might look ugly in combination with the light effect. Using this option you can deactivate the usage of a different task item frame on hover.
de: Normalerweise wird wenn die Maus einen Task berührt ein anderer Rahmen um den Task gezeichnet. Bei manchen Plasma Themen sieht dies jedoch hässlich aus, wenn der Lichteffekt verwendet wird. Mit dieser Option kann verhindert werden, dass bei Berührung ein anderer Rahmen gezeichnet wird.
fr: Habituellement, un encadrement différent est utilisé pour la tâche lorsque le pointeur de souris la survole. Pour quelques thèmes plasma, la combinaison du changement de cadre avec le rétro-éclairage de la tâche a un mauvais rendu. Cette option désactive l'utilisation d'un cadre différent au survol.

source: As &Only Hover Effect
de: &Einziger Effekt bei Berührung
fr: Comme seul effet du sur&vol

source: Draw &Text-Shadow
de: &Textschatten anzeigen
fr: Activer les o&mbres de texte

source: When this is checked the dominant color of the task icon is used as the light color. When only an ugly (grayish) color could be extracted the color specified above is used instead.
de: Unter Verwendung dieser Option wird die für das Licht die dominante Farbe des Task Symbols verwendet. Sollte nur eine hässliche (graue) Farbe aus dem Symbol extrahiert werden können, dann wird die Farbe von oben verwendet.
fr: Quand ceci est coché, la couleur dominante de l'icône de tâche est utilisée comme couleur de rétro-éclairage. Lorsque qu'une couleur grisâtre est ansi extraite, la couleur spécifiée ci-dessus est utilisée à la place.

source: Color From &Icon
de: Farbe vom Programmsymbol
fr: Couleur de l'icô&ne

source: &Color:
de: &Farbe:
fr: &Couleur:

source: Switch Tasks using &Wheel
de: Tasks mit dem &Mausrad wechseln
fr: C&hanger de tâche avec la molette

source: Expand on &Attention
de: Bei geforderter &Aufmerksamkeit aufklappen
fr: Dével&opper à l'appel d'attention

source: Taskbar Layout
de: Taskleisten-Layout
fr: Barre des tâches

source: Row Constraints
de: Zeilen-Beschränkungen
fr: Contraintes sur les lignes

source: &Minimum Rows:
de: &Minimale Zeilenanzahl:
fr: Nombre &minimum de lignes:

source: This defines the minimum row count. Some layouts stretch the filled rows in order to fill any empty space. This way the displayed rows might be still fewer than this value.
de: Dieser Wert gibt die minimale Zeilenanzahl an. Manche Layouts strecken die gefüllten Zeilen so, dass keine leeren Zeilen angezeigt werden. In diesen Fall können weniger Zeilen angezeigt werden als dieser Wert angibt.
fr: Ceci définit le nombre minimum de lignes. Certaines dispositions étirent les lignes non vides afin de remplir l'espace restant. De ce fait, les lignes affichées peuvent être moins nombreuses que cette valeur.

source: Ma&ximum Rows:
de: Ma&ximale Zeilenanzahl:
fr: Nombre ma&ximum de lignes:

source: This defines the maximum row count.
de: Dieser Wert gibt die maximale Anzahl an Zeilen an.
fr: Ceci définit le nombre maximum de lignes.

source: <p>The layout is responsible for the size and placement of the task items. Each of the provided layouts has other advantages and disadvantages. Because I can't decide which layouting strategy is best suited for this purpose I include several choices for now.</p> <h4>By Taskbar Shape</h4> <p>This layout creates as much rows as are needed so that following condition is met:</p> <pre>row height &times; row aspect ratio &le; row width</pre> <p>However, if this would yield empty rows the filled rows are scaled in height so that the whole task bar space is covered.</p> <h4>Maximum Squeeze</h4> <p>Because the width of the task items depends of their height the more rows there are the less room the items occupy. This layout sets the width of the task items always to the width they would have when the row count would have reached the maximally allowed value. <h4>Fixed Item Number per Row</h4> <p>This layout always put the configured number of task items into one row, unless there would not be enough room for all task items. Then the items are distributed evenly over the rows.</p> <h4>Limited Squeeze</h4> <p>This layout tries to squeeze the task items only up to a given maximum squeeze ratio. If it would have to squeeze them more than that it creates a new row. Currently this layout is the only one that respects the “Prefer Grouping” setting.</p> <h4>Fixed Maximum Item Height</h4> <p>This layout always assumes the configured height of the task items. Through the dependency between the width and height of the task items this leads to a specific distribution of the items. This layout does not fill empty space by up-scaling the rows.</p>
de: <p>Das Layout ist für die Größe und die Platzierung der Tasks verantwortlich. Jedes der zur Verfügung gestellten Layouts hat Vor- und Nachteile. Zumal ich nicht zu entscheiden mag welches am besten für eine Taskleiste geeignet ist, biete ich eine Auswahl von Layouts an.</p> <h4>Nach der Form der Taskleiste</h4> <p>Dieses Layout erzeugt so viele Zeilen wie nötig um folgende Bedingung zu erfüllen:</p> <pre>Zeilenhöhe &times; Zeilen Seitenverhältnis &le; Zeilenbreite</pre> <p>Wenn jedoch hieraus Leerzeilen erfolgen würden werden die gefüllten Zeilen in ihrer Höhe skaliert um den freien Bereich aufzufüllen.</p> <h4>Maximale Dichte</h4> <p>Zumal die Breite der Tasks von ihrer Höhe abhängt passen immer mehr Tasks in eine Zeile, je mehr Zeilen es gibt. Dieses Layout setzt die Breite der Tasks immer auf die Breite, die sie hätten wenn die <tt>Maximale Zeilenanzahl</tt> erreicht wäre.</p> <h4>Fixe Anzahl von Tasks pro Zeile</h4> <p>Dieses Layout setzt immer die konfigurierte Anzahl und Tasks in eine Zeile, außer es gibt nicht genug Platz für alle Tasks. Dann werden die Tasks auf alle Zeilen gleich aufgeteilt.</p> <h4>Beschränkte Komprimierung</h4> <p>Dieses Layout versucht die Tasks nicht mehr als die angegebenen maximale Komprimierung zu schrumpfen. Wenn die Tasks stärker geschrumpft werden müssten um in eine Zeile zu passen wird eine neue Zeile eingefügt. Zur Zeit ist dieses Layout das einzige, welches die „Bevorzuge Gruppierung“ Option respektiert.</p> <h4>Fixe maximale Task Höhe</h4> <p>Dieses Layout nimmt immer die konfigurierte Höhe der Tasks an. Durch die Abhängigkeit zwischen der Breite und Höhe der Tasks führt dies zu einer spezifischen Aufteilung der Tasks auf die Zeilen. Dieses Layout füllt etwaigen freien Raum nicht auf.</p>
fr: <p>La Disposition gère la taille et le placement des tâches. Chaque disposition fournie a ses avantages et inconvénients. Comme il est difficile de déterminer quelle stratégie de disposition est la plus appropriée, plusieurs alternatives sont proposées.</p> <h4>Selon la forme de la barre des tâches</h4> <p>Cette disposition crée autant de lignes qu'il est nécessaire pour que la condition suivante soit satisfaite:</p> <pre>hauteur de ligne &times; proportion de ligne &le; largeur de ligne</pre> <p>Cependant, si cette valeur génère des lignes vides, les autres lignes sont redimensionnées pour remplir la barre des tâches sur sa hauteur.</p> <h4>Réduire au maximum</h4> <p>Parce que la largeur des tâches dépend de leur taille, plus il y a de tâches moins chacune occupe d'espace. Cette disposition donne aux tâches la largeur qu'elles auraient si le nombre maximum de tâches par ligne était atteint.</p> <h4>Nombre fixe de tâches par ligne</h4> <p>Cette disposition remplit chaque ligne jusqu'à atteindre le nombre de tâches indiqué, sauf il n'y a pas assez de place. Dans ce cas, les tâches sont réparties uniformément sur toutes les lignes.</p> <h4>Réduire à proportion</h4> <p>Cette disposition essaie de compresser les tâches jusqu'à un taux de réduction maximum paramétrable. Aller au delà de cette réduction crée une nouvelle ligne. Actuellement, cette disposition est la seule à tenir compte de l'option «Préférer le regroupement»</p> <h4>Hauteur maximale des tâches fixe</h4> <p>Cette disposition applique toujours la hauteur configurée pour les tâches. De par la dépendance entre la largeur et la hauteur d'une tâche, ceci conduit à une distribution spécifique des tâches. Cette disposition n'agrandit pas les tâches pour combler les lignes vides.</p>

source: Row &Aspect Ratio:
de: Zeilen-&Seitenverhältnis:
fr: Pr&oportion d'une ligne:

source: The “By Taskbar Shape” layout uses this value to determine how many rows should be created.
de: Das „Nach der Form der Taskleiste“-Layout verwendet diesen Wert um zu ermitteln wie viele Zeilen angezeigt werden sollen.
fr: La disposition «Selon la forme de la barre des tâches» utilise cette valeur pour déterminer combien de lignes doivent être créées.

source: &Items per Row:
de: Tasks pro &Zeile
fr: &Tâches par ligne:

source: The “Fixed Item Number per Row” layout uses this amount to fill the rows with task items.
de: Das „Fixe Anzahl von Tasks pro Zeile“-Layout verwendet diesen Wert um die Zeilen mit entsprechend vielen Tasks aufzufüllen.
fr: La disposition «Nombre fixe de tâches par ligne» utilise cette valeur pour remplir la ligne avec des tâches.

source: Maximum Item &Height:
de: Maximale Task-&Höhe
fr: &Hauteur maximale des tâches:

source: The “Fixed Maximum Item Height” layout uses this value to determine the size of the task items.
de: Das „Fixe maximale Task Höhe“-Layout verwendet diesen Wert um die Größe der Tasks zu ermitteln.
fr: La disposition «Hauteur maximale des tâches fixe» utilise cette valeur pour déterminer la taille des tâches.

source: Maximum &Squeeze Ratio:
de: Maximales &Komprimierungsverhältnis:
fr: Tau&x de réduction maximum:

source: <p>The “Limited Squeeze” layout tries not to squeeze items so that <tt>squeezed item width / item width &ge; maximum squeeze ratio</tt>.</p>
de: <p>Das „Beschränkte Komprimierung“ Layout versucht die Tasks nur so stark zu komprimieren, dass <tt>Komprimierte Task-Breite / Task-Breite &ge; Maximale Komprimierung</tt> erfüllt ist.</p>
fr: <p>La disposition «Réduction à proportion» essaie de réduire les tâches en respectant la condition :<tt>largeur de la tâche réduite / largeur initiale de la tâche &lt; taux de réduction maximum</tt>.</p>

source: Prefere grouping of tasks over the creation of new rows (currently only supported by the Limited Squeeze” layout).
de: Bevorzuge das Gruppieren von Tasks vor dem Erzeugen neuer Zeilen (zur Zeit nur vom „Beschränkte Komprimierung“-Layout unterstützt).
fr: Préférer le regroupement des tâches à la création de nouvelles lignes (Actuellement, uniquement supporté par la disposition «Réduction à proportion»).

source: &Prefer Grouping
de: &Bevorzuge Gruppierung
fr: &Préférer le regroupement

source: Tool Tip
de: Kurzinfo
fr: Info&bulle

source: Preview St&yle:
de: &Vorschaumodus:
fr: St&yle de l'aperçu:

source: <h4>Classic</h4> <p><img src=":/imgs/imgs/classic-style.png" /></p> <h4>New</h4> <p><img src=":/imgs/imgs/new-style.png" /></p>
de: <h4>Klassisch</h4> <p><img src=":/imgs/imgs/classic-style.png" /></p> <h4>Neu</h4> <p><img src=":/imgs/imgs/new-style.png" /></p>
fr: <h4>Classique</h4> <p><img src=":/imgs/imgs/classic-style.png" /></p> <h4>Nouveau</h4> <p><img src=":/imgs/imgs/new-style.png" /></p>

source: Preview Si&ze:
de: Vorschau&größe:
fr: &Taille de l'aperçu:

source: This value defines the maximum length of one side of window previews.
de: Dieser Wert definiert die maximale Länge einer Seite der Vorschaubilder.
fr: Selon orientation de la barre des tâches, largeur ou Hauteur maximale des miniatures de fenêtres (aperçus).

source: Tool Tip &Type:
de: Kurz&info-Art:
fr: Ty&pe d'infobulle:

source: <h4>None</h4> <p>Don't display tool tips.</p> <h4>Smooth</h4> <p>Use advanced tool tips for the task items. These tool tips show window previews that can be clicked to activate the corresponding window. When you hover the preview the window gets highlighted. However, this kind of tool tip is not well integrated with plasma.</p> <h4>Plasma</h4> <p>Use native plasma tool tips. This kind of tool tips do not provide the features described above. Instead they integrate well with other applet's tool tips and move animated across applets.</p>
de: <h4>Keine</h4> <p>Keine Kurzinfos anzeigen.</p> <h4>Smooth</h4> <p>Diese Art der Kurzinfos zeigt Vorschaubilder an, die angeklickt werden können um die entsprechenden Fenster zu aktivieren. Bei Mauskontakt wird das dazugehörende Fenster hervorgehoben. Diese Kurzinfos integrieren sich jedoch nicht vollständig in die Plasma-Oberfläche.</p> <h4>Plasma</h4> <p>Diese Art der Kurzinfos bietet keine der oben genannten Eigenschaften and, integriert sich jedoch in die Plasma-Oberfläche. Dies bedeutet Plasma Kurzinfos bewegen sich über Applet Grenzen hinweg auch zu anderen Applets.</p>
fr: <h4>Rien</h4> <p>Ne pas afficher d'infobulle.</p> <h4>Smooth</h4> <p>Utiliser les infobulles avancées pour les tâches. Ces infobulles montrent des aperçus de fenêtres. On peut cliquer sur ces derniers pour activer la fenêtre correspondante. De plus, quand vous placez le pointeur de souris sur l'aperçu, il passe en surbrillance. Cependant, ce type d'infobulle n'est pas bien intégré à plasma.</p> <h4>Plasma</h4> <p>Utiliser les infobulles natives de plasma. Ces infobulles ne présentent pas les fonctionnalités décrites plus haut. Néanmoins, elles s'intégrent bien aux infobulles d'autres widgets et aux déplacements animés entre widgets.</p>

source: Move &Duration:
de: &Bewegungsdauer:
fr: Durée de dé&placement de l'infobulle:

source: &Highlight Delay:
de: &Hervorhebungs Verzögerung:
fr: Délai de mise en su&rbrillance

source: &Frames per Second:
de: Bil&der in der Sekunde:
fr: Im&ages par seconde:

source: &Animation Duration:
de: &Animationdauer:
fr: Durée de l'&Animation:

source: This defines the duration of animations like the expansion of tasks and the delay for which a tool tip will be shown after you stopped hovering the task item or tool tip.
de: Dieser Wert gibt die Dauer von Animationen wie das Aufklappen der Tasks und die Dauer für welche Kurzinfos noch angezeigt werden sollen, wenn die Maus diese bzw. den entsprechenden Task bereits verlassen hat.
fr: Ceci définit la durée des animations comme le développement de tâches et le délai pendant lequel une infobulle sera affichée après que le pointeur de souris cesse d'être sur la tâche.

source: Grouping & Sorting
de: Gruppierung und Sortierung
fr: Tri et regroupement

source: &Grouping:
de: &Gruppierung:
fr: &Grouper:

source: Only when the taskbar is &full
de: Nur falls die Taskleiste &voll ist
fr: Uniquement si la barre des tâches est &pleine

source: &Sorting:
de: &Sortieren:
fr: T&rier:

source: Filters
de: Filter
fr: Filtres

source: Only show tasks that are &minimized
de: Nur &minimierte Fenster anzeigen
fr: Montrer seulement les tâches &minimisées

source: Only show tasks from the current &desktop
de: Nur Fenster der aktuellen &Arbeitsfläche anzeigen
fr: Montrer seulement les tâches du &bureau courant

source: Only show tasks from the current s&creen
de: Nur Fenster des aktuellen &Bildschirms anzeigen
fr: Montrer seulement les tâches de l'é&cran courant

source: Middle Click &Action:
de: Mittel-Klick &Aktion:
fr: Action sur clic milieu de la so&uris:

source: Action that should be performed when a task item is middle clicked.
de: Auszuführende Aktion, wenn die mittlere Maustaste auf einem Task geklickt wird.
fr: Action effectuée lorsqu'on clique sur une tâche avec le bouton du milieu de la souris.

# NAME OF TRANSLATORS
source: Your names
de: Fabian Würtz, Mathias Panzenböck, Markus Slopianka
fr: Sergio Guibert

# EMAIL OF TRANSLATORS
source: Your emails
de: xadras@sidux.com, grosser.meister.morti@gmx.net, kamikazow@web.de
fr: sergio.guibert@gmail.com

source: &Layout:
fr: &Disposition:
